// Задача 60. Сформируйте трёхмерный массив из неповторяющихся двузначных чисел. 
// Напишите программу, которая будет построчно выводить массив, добавляя индексы каждого элемента.
// массив размером 2 x 2 x 2

// 12(0,0,0) 22(0,0,1)
// 45(1,0,0) 53(1,0,1)


int[,,] myarr = 
{
    {
        {11,12,13},
        {14, 15, 16}
    },

    {
        {21,22,23},
        {24,25,26}
    },

      {
        {31,32,33},
        {34,35,36}
    }
};


Console.ReadLine();

for (int i = 0; i < myarr.GetLength(0); i++)
{
    Console.WriteLine("page № " + (i + 1) + ":");
    for (int j = 0; j < myarr.GetLength(1); j++)
    {
        for (int k = 0; k < myarr.GetLength(2); k++)
        {
           Console.Write($"{myarr[i, j, k]}({i},{j},{k})\t");
        }
        Console.WriteLine();
    }
    Console.WriteLine("===============");
}